// в блоке текста найти украинские телефонные номера и вывести на экран

const data = `Мова значно запозичила синтаксис 0979999999із C і C++. Зокрема, взято за основу об'єктну модель С++, 
проте її модифіковано. Усунуто можливіс+380660112233ть появи деяких конфліктних ситуацій, що могли виникнути через 
помилки прогр45654645аміста та полегшено сам процес розробки об'єктно-орієнтованих `;

function findPhones(data) {
	const findData = data.match(/(0|\+380)\d{9}/g);
	// let reg = /(0|\+380)\d{9}/g;
	// const findData = data.matchAll(reg);
	console.log(findData);
	// console.log(Array.from(findData));
}
findPhones(data);
