// усложним немного задание и в блоке текста найдем кредитные карточки только visa, это номер карты начинается на 4

const data = `Мова значно за 4441-3333-4444-5555 позичила синтаксис 09 79999999із C і C++. Зокрема, взято за основу 
об'єктну модель С++, проте її 5375 2222 3333 4444модифіковано. 334 ть появи деяких конфліктних 5375222233334444 
ситуацій, що могли виникнути через помилки `

function findCard(data) {
	const findData = data.match(/(4\d{3}[- ]?)(\d{4}[- ]?){2}\d{4}/g);
	console.log(findData);
}
findCard(data);
