// Мережа фастфудів пропонує кілька видів гамбургерів:

//     маленький (50 грн, 20 калорій);
//     великий (100 грн, 40 калорій).

// Гамбургер може бути з одним із декількох видів начинок:

//     сиром (+ 10 грн, + 20 калорій);
//     салатом (+ 20 грн, + 5 калорій);
//     картоплею (+ 15 грн, + 10 калорій).

// Можна додати добавки:

//     посипати приправою (+15 грн, 0 калорій)
//      полити майонезом (+ 20 грн, +5 калорій).

// Напишіть програму, яка розраховує вартість та калорійність гамбургера.

//  Використовуйте ООП підхід

// Усі розміри бургера, добавки , начинки повинні бути доступні у вигляді статичних властивосте

// Приклад роботи коду:
