// Написати цикли, які зможуть:
// Вивести на сторінку в один рядок через кому числа від 10 до 20.
// Вивести квадрати чисел від 10 до 20.
// Вивести таблицю множення на 7.
// Знайти добуток усіх цілих чисел від 15 до 35.
// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// Вивести суму лише парних чисел в діапазоні від 30 до 80.

// Кожне завдання зі списку повинен виконувати окремий цикл, значення виводити в консоль.
// Кожне завдання виводити в консоль застосовувючи console.group('Текст завдання')

for (let i = 10; i <= 20; i++) {
  console.log(`${i},`);
}

// i = i + 2;
// i += 2
