// Дано масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

//
// Знайти мінімальний елемент масиву та його порядковий номер.
// Знайти максимальний елемент масиву та його порядковий номер.
// Визначити кількість негативних елементів.
// Знайти добуток позитивних елементів.

// Кожне завдання зі списку повинен виконувати окремий цикл, значення виводити в консоль.

// Кожне завдання виводити в консоль застосовувючи console.group('Текст завдання')

const array = [
  16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4,
  47,
];

console.group('Знайти суму та кількість позитивних елементів.');
let counter = 0;
let sum = 0;
for (i = 0; i <= array.length; i++) {
  if (array[i] > 0) {
    sum += array[i];
    counter++;
  }
}
console.log(sum, counter);
console.groupEnd();

console.group('Знайти мінімальний елемент масиву та його порядковий номер.');
let min = array[0];
for (i = 0; i <= array.length; i++) {
  if (array[i] < min) {
    min = array[i];
  }
}
console.log(min, i + 1);
console.groupEnd();
