// Створити масив з 10 студентів.

// Додати 2 студенти в кінець масиву
// Додати 2 студенти на початок масиву
// Видалити останнього студента
// Видалити першого студента
// Користувач вводить імя студента, перевірити чи такий студент є масиві і вивести результат в консоль
// Створити ще один масив з існуючого, включивши в нього студентів починаючи з індекса 3 і закінчуючи індесом 6 включно ( 3,4,5,6)
// Створити ще один масив нових студентів(довжина 5), і обєднати існуючих студентів з новими у новий масив усі студенти. ДАЛІ ПРАЦЮЄМО З МАСИВОМ УСІ СТУДЕНТИ
// Видалити студента номер 4
// Замінити студента номер 6 на студента з ім'ям Іван
// Вививести усіх студентів у консоль у вигляді стрічки, студенти повинні бути розділені символом тире -
// УСІ ЗАВДАННЯ ПОВИННІ БУТИ ВИКОНАНІ У ОДНОМУ ФАЙЛІ

const students = [
  'Alex',
  'Ivan',
  'Petro',
  'Andriy',
  'Vlad',
  'Serhiy',
  'Vadim',
  'Elena',
  'Fedor',
  'Stacy',
];

students.push('Renat', 'Georgiy');
students.unshift('Olya', 'Tunar');
students.pop();
